{
  "title": "Portman, Finance Committee Republicans: Congress Should Close the Book on the Failed Book Minimum Tax - Senator Rob Portman",
  "url": "https://www.portman.senate.gov/newsroom/press-releases/portman-finance-committee-republicans-congress-should-close-book-failed",
  "date": "Wed, 02 Feb 2022 22:56:43 GMT",
  "content": "<a href=\"https://www.portman.senate.gov/newsroom/press-releases/portman-finance-committee-republicans-congress-should-close-book-failed\" target=\"_blank\">Portman, Finance Committee Republicans: Congress Should Close the Book on the Failed Book Minimum Tax</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Senator Rob Portman</font>",
  "image": "https://www.portman.senate.gov/sites/default/files/2021-03/SenatorRobPortman.png",
  "description": "WASHINGTON, D.C.— Today, U.S. Senator Rob Portman (R-OH), along with all of the Republican members of the Senate Finance Committee, urged Senate colleagues to reconsider efforts to implement a tax on financial statement income of U.S. companies, or a “book minimum tax,” detailing the problematic and unaddressed issues that have resulted from such proposals in the past. As the senators note, Republicans and Democrats rejected a previously enacted book minimum tax due to its numerous flaws and negative effects. Last December, Senator Portman spoke on the Senate floor outlining the harmful consequences of the book minimum tax in the Democrats’ reckless tax and spending proposal. He discussed his concerns with the new tax hike, saying it would amount to a new corporate alternative minimum tax that would not be based on income, but rather book value. He also highlighted how the tax would add to already surging inflation and that workers will be hurt the most.\n\n“This fundamentally flawed proposal, which has not been properly vetted by either Congressional tax-writing committee, risks severely harming American manufacturers, exacerbating supply-chain disruptions, and ultimately costing U.S. jobs and investment. . . . Now is not the time to resurrect a harmful policy that would overwhelmingly hit American manufacturers and supply chains, as well as undercut critical research and development and investment in renewable energy and other emerging technologies,” wrote the senators.\n\n“Simply stated, book income is not calculated and reported for tax purposes, and taxable income is not calculated and reported to provide a statement of financial condition for investors.  Blending the two would muddle different concepts and purposes, to the detriment of both tax policy and standards of accounting,” continued the senators.\n\n“Even more alarming is that this proposal, which would affect hundreds of American companies, millions of American jobs, and a massive share of the American economy, is being pursued without proper consideration by either the Senate Finance Committee or the House Ways and Means Committee in a hearing or markup. As a result, unintended consequences are sure to follow, requiring carve-outs beyond the one recently and hastily added for pension plans,” they concluded. \n\nFull text of the letter, signed by all Republican Finance Committee members, is available here and below. \n\nDear Colleague:\n\nWe urge you to reconsider the proposed tax on financial statement income of U.S. companies (the “book minimum tax”) included in the Build Back Better Act (H.R. 5376).  This fundamentally flawed proposal, which has not been properly vetted by either Congressional tax-writing committee, risks severely harming American manufacturers, exacerbating supply-chain disruptions, and ultimately costing U.S. jobs and investment.  While Republicans and Democrats may disagree on the best tax policy to create high-paying U.S. jobs and facilitate lasting economic growth, both parties rejected a previously enacted book minimum tax due to its numerous flaws and negative effects.  Now is not the time to resurrect a harmful policy that would overwhelmingly hit American manufacturers and supply chains, as well as undercut critical research and development and investment in renewable energy and other emerging technologies.  \n\nAs currently proposed, the book minimum tax would impose a 15 percent minimum tax on American businesses, though not on the income they are required to report to the IRS—so-called taxable income.  Rather, the tax would be levied on income they report for financial statement purposes, known as book income.  In doing so, the proposal would forgo taxation based on the tax code in favor of accounting standards, which are determined without Congressional oversight and may not reflect current realities of the business cycle.  \n\nBecause capital investments are treated differently for book and tax purposes, the proposal would impose a particularly burdensome tax on capital investment made by American manufacturers, energy companies, and other major job-creators.  This would eliminate or significantly reduce the benefit of the very tax policies Congress has spent decades crafting to encourage investment in American facilities and to support American jobs.  As the National Association of Manufacturers rightly highlighted, “[I]mposing a book tax would not only undermine the recovery but also make it harder for the next manufacturing dollar to be spent in America, negatively impacting growth in family-supporting American manufacturing jobs.”  Taxing based on these book-tax differences would have a devastating impact on many companies and sectors, including manufacturing, insurance, renewable energy, wireless, and projects relying on state and local financing.    \n\nNotably, a book minimum tax was attempted in the late 1980s and ultimately failed, with bipartisan acknowledgement that the policy was unworkable.  The policy proved so flawed that it was rejected resoundingly by Republicans and Democrats alike after three short years in law.  As the then-Democrat Ways and Means Chairman observed, “When used for tax purposes, the book income concept not only invites manipulation, but can lead to inequitable results because of timing differences between tax and accounting rules.”  This is a widely held view among experts.  As the American Institute of CPAs (AICPA) stated, “Income tax provisions should not influence company decisions as to the adoption of accounting methods.  These types of distortions could potentially harm shareholders and creditors who depend on financial statements for important information.  Public policy taxation goals should not have a role in influencing accounting standards or the resulting financial reporting.  Independence and objectivity of accounting standards are the backbone of our capital markets system.”   A book minimum tax, however well-intentioned, will introduce more, not less, unfairness and uncertainty into our tax system. \n\nSimply stated, book income is not calculated and reported for tax purposes, and taxable income is not calculated and reported to provide a statement of financial condition for investors.  Blending the two would muddle different concepts and purposes, to the detriment of both tax policy and standards of accounting.  \n\nAlso of significant concern is this proposal’s delegation of Congressional tax-writing authority to an unelected and unaccountable board, such as the Financial Accounting Standards Board.  As noted by AICPA, “[I]mposing tax according to financial statement income takes the definition of taxable income out of Congress’s hands and puts it into the hands of industry regulators and others.”   However, these industry regulators and others are not best suited to carry out a role that would be by its very nature both political and policy driven.  Rather than abdicate its responsibility to an unelected and unaccountable board, Congress should continue to fulfill its constitutional obligations to the American people by remaining firmly in control of the tax-writing process.\n\nWhile we oppose many of the tax proposals included in the Build Back Better Act, our concerns about fundamental flaws of the book minimum tax are shared overwhelmingly by policy experts.  Economists acknowledge that the book minimum tax will increase the cost of capital for affected companies, and distortions will arise because “[c]ompanies in similar economic situations could face vastly different costs of capital for the same investment.”   Similar concerns have even been raised within President Biden’s Treasury Department.  According to the Washington Post, officials in the Treasury Department’s Office of Tax Policy expressed concerns that “the new 15 percent minimum tax could lead to unintended consequences – such as limiting clean energy investment – and prove difficult to implement while making the tax code less efficient.” \n\nEven more alarming is that this proposal, which would affect hundreds of American companies, millions of American jobs, and a massive share of the American economy, is being pursued without proper consideration by either the Senate Finance Committee or the House Ways and Means Committee in a hearing or markup.  As a result, unintended consequences are sure to follow, requiring carve-outs beyond the one recently and hastily added for pension plans.  Given the apparent delay in the Senate’s processing of H.R. 5376, there is ample time for the Senate Finance Committee to properly consider this legislation and contemplate its effect on Congress’s constitutional authority over the tax-writing process.  Setting important tax policies that will affect all Americans requires a formal markup process, as was done with the Tax Cuts and Jobs Act in 2017, to allow input from both sides, instead of unilateral and partisan decision-making.    \n\nSincerely,\n\n###",
  "publisher": "Google News Finance USA",
  "publisherUrl": "https://news.google.com/search?q=finance&hl=en-US&gl=US&ceid=US:en"
}